In [ ]:
!pip list

In [259]:
import pandas as pd

# 1. Create

In [190]:
df = pd.read_csv('salaries_dataset.csv')

# 2. Read

### 2.1 Show top 5 & Botoom 5

In [17]:
df.head() #top 5

  REGISTER_ID GENDER  AGE  INCOME
0    AP110000      F   33   15000
1    AP110001      F   38   50000
2    AP110002      M   35   40000
3    AP110003      F   38   20000
4    AP110004      F   23   40000

In [18]:
df.tail() # bottom 5

     REGISTER_ID GENDER  AGE  INCOME
9995    AP119995      M   27   15000
9996    AP119996      F   24   12000
9997    AP119997      M   25   35000
9998    AP119998      F   33   20000
9999    AP119999      M   27   30000

### 2.2 Show Column's & Datatypes

In [23]:
df.info() # Shows info about your df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   REGISTER_ID  10000 non-null  object
 1   GENDER       10000 non-null  object
 2   AGE          10000 non-null  int64
 3   INCOME       10000 non-null  int64
dtypes: int64(2), object(2)
memory usage: 312.6+ KB

### 2.3 Summary Statastics

In [26]:
df.describe() # Suammary Statastics of (int & float)

                AGE        INCOME
count  10000.000000  10000.000000
mean      35.496700  26357.400000
std        8.594415  12801.978531
min       21.000000  10000.000000
25%       28.000000  15000.000000
50%       35.000000  25000.000000
75%       43.000000  35000.000000
max       50.000000  50000.000000

In [25]:
df.describe(include = 'object') # Summary Statastics of (object) type

       REGISTER_ID GENDER
count        10000  10000
unique       10000      2
top       AP110000      M
freq             1   5047

### 2.4 Filter on Columns

In [40]:
df.columns # display col

Index(['REGISTER_ID', 'GENDER', 'AGE', 'INCOME'], dtype='object')

In [54]:
df['REGISTER_ID'].head() # display single col

0    AP110000
1    AP110001
2    AP110002
3    AP110003
4    AP110004
Name: REGISTER_ID, dtype: object

In [66]:
df[['REGISTER_ID', 'GENDER']].head() #display multiple col

  REGISTER_ID GENDER
0    AP110000      F
1    AP110001      F
2    AP110002      M
3    AP110003      F
4    AP110004      F

In [63]:
df['GENDER'].unique() # Unqiue values of Gender col

array(['F', 'M'], dtype=object)

In [65]:
df['REGISTER_ID'].nunique() # sum of the unqiue values in ID col

10000

### 2.5 Filter on Rows

In [72]:
df.head() # Top 5

  REGISTER_ID GENDER  AGE  INCOME
0    AP110000      F   33   15000
1    AP110001      F   38   50000
2    AP110002      M   35   40000
3    AP110003      F   38   20000
4    AP110004      F   23   40000

In [71]:
# Display only the Rows with Gender == 'F'
df[df['GENDER'] == 'F'].head()

  REGISTER_ID GENDER  AGE  INCOME
0    AP110000      F   33   15000
1    AP110001      F   38   50000
3    AP110003      F   38   20000
4    AP110004      F   23   40000
5    AP110005      F   38   40000

In [127]:
df[(df['AGE'] == 33) & (df['INCOME'] == 10000)][['AGE', 'INCOME']].head()  # Female of Age 33 with 10k INCOME

      AGE  INCOME
816    33   10000
1321   33   10000
1455   33   10000
1802   33   10000
2814   33   10000

In [138]:
df[(df['AGE'] >= 35) & (df['INCOME'] >= 50000)][['AGE', 'INCOME']].describe() # Poeople with age >= 35 & income >= 50,000

              AGE   INCOME
count  607.000000    607.0
mean    42.293245  50000.0
std      4.661443      0.0
min     35.000000  50000.0
25%     38.000000  50000.0
50%     42.000000  50000.0
75%     46.000000  50000.0
max     50.000000  50000.0

### 2.6 Indexing with iloc 
 - Integer Based Filter

In [155]:
df.iloc[20] # 20 th row on dataFrame

REGISTER_ID    AP110020
GENDER                F
AGE                  25
INCOME            20000
Name: 20, dtype: object

In [159]:
df.iloc[20, 0] # 20th row 0th col value in our DataFrame

'AP110020'

In [161]:
df.iloc[20, -1] # 20th row bottom first col value

20000

### 2.7 Indexing with loc
 - indexing with keywords

In [162]:
df.head(1)

  REGISTER_ID GENDER  AGE  INCOME
0    AP110000      F   33   15000

In [169]:
df1 = df.copy() # Copying df to (df1)
df1.set_index('GENDER', inplace = True) # setting 'Gender' col as index to use loc

In [175]:
df1.head() # top 5

       REGISTER_ID  AGE  INCOME
GENDER
F         AP110000   33   15000
F         AP110001   38   50000
M         AP110002   35   40000
F         AP110003   38   20000
F         AP110004   23   40000

In [184]:
df1.loc['F'] # Female Rows in df1

       REGISTER_ID  AGE  INCOME
GENDER
F         AP110000   33   15000
F         AP110001   38   50000
F         AP110003   38   20000
F         AP110004   23   40000
F         AP110005   38   40000
...            ...  ...     ...
F         AP119989   43   15000
F         AP119990   33   10000
F         AP119992   33   40000
F         AP119996   24   12000
F         AP119998   33   20000

[4953 rows x 3 columns]

In [183]:
df1.loc['M'] # Male rows in df1

       REGISTER_ID  AGE  INCOME
GENDER
M         AP110002   35   40000
M         AP110008   42   20000
M         AP110009   39   10000
M         AP110010   41   25000
M         AP110014   44   25000
...            ...  ...     ...
M         AP119993   30   10000
M         AP119994   22   20000
M         AP119995   27   15000
M         AP119997   25   35000
M         AP119999   27   30000

[5047 rows x 3 columns]

### 3. Update

#### 3.1 Dropping Rows

In [186]:
df.isnull().sum() # Sum of Null values in DataFrame

REGISTER_ID    0
GENDER         0
AGE            0
INCOME         0
dtype: int64

### 3.2 Dropping Columns

In [191]:
df.drop('REGISTER_ID', axis = 1, inplace = True) # Dropping 'REGISTER_ID' col

In [192]:
df.head()

  GENDER  AGE  INCOME
0      F   33   15000
1      F   38   50000
2      M   35   40000
3      F   38   20000
4      F   23   40000

### 3.3 Creating Columns

In [200]:
df['Churn'] =  # Creating col named 'Churn'

In [201]:
df.head() #top 5

  GENDER  AGE  INCOME  Churn
0      F   33   15000      0
1      F   38   50000      0
2      M   35   40000      0
3      F   38   20000      0
4      F   23   40000      0

#### 3.3 Update Columns

In [232]:
df['Churn'] = True # Updating row values with 'True'
df.head()

  GENDER  AGE  INCOME  Churn
0      F   33   15000   True
1      F   38   50000   True
2      M   35   40000   True
3      F   38   20000   True
4      F   23   40000   True

#### 3.4 Updating a Single Column Value

In [213]:
df.iloc[0, -1] # 0th row -1 col value whih is (CHurn: True)

True

In [233]:
df.iloc[0, -1] = False # updating row value of df.iloc[0, -1] to False

In [226]:
df.head() # top5

  GENDER  AGE  INCOME  Churn
0      F   33   15000  False
1      F   38   50000   True
2      M   35   40000   True
3      F   38   20000   True
4      F   23   40000   True

#### 3.5 Condiiton based Updating using Apply

In [234]:
df['Churn'] = df['Churn'].apply(lambda x: 0 if x == True else 1) # applying using lambda fn True = 0, False = 1

In [236]:
df.head() # top 5

  GENDER  AGE  INCOME  Churn
0      F   33   15000      1
1      F   38   50000      0
2      M   35   40000      0
3      F   38   20000      0
4      F   23   40000      0

In [237]:
df['Churn'] = df['Churn'].apply(lambda x: 0 if x == 1 else 0) # Reapplying 1 to 0 using lambda fn

In [238]:
df.head()

  GENDER  AGE  INCOME  Churn
0      F   33   15000      0
1      F   38   50000      0
2      M   35   40000      0
3      F   38   20000      0
4      F   23   40000      0

### 4. Delete / Ouput

In [258]:
df.to_csv('pandas.csv') # import df to csv

In [ ]:
df.to_json() #import df to json

In [ ]:
df.to_html() #import df to html

In [ ]:
del df #delete df

In [ ]:
!